Белгипрозем_2017/src/Documents/ВходящееСообщениеСВД/ВходящееСообщениеСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящееСообщениеСВД</name>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.ВидыСообщенийСВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСессии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентОтправитель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимостьПосылкиУведомлений</name>
    <type>
      <types>EnumRef.НеобходимостьПосылкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортПолучения</name>
    <type>
      <types>CatalogRef.ТранспортыСВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>CatalogRef.ФорматыСообщенийСВД</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеУспешноПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Enums/ТипыХраненияФайлов/ТипыХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыХраненияФайлов</name>
  <enumValues>
    <name>ВИнформационнойБазе</name>
  </enumValues>
  <enumValues>
    <name>ВТомахНаДиске</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/ФорматыСообщенийСВД/ФорматыСообщенийСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФорматыСообщенийСВД</name>
  <predefined>
    <items>
      <name>СообщениеПоГОСТ53898ВложенныеФайлы</name>
      <description>ГОСТ Р 53898-2010</description>
    </items>
    <items>
      <name>Сообщение1СДокументооборот</name>
      <description>Сообщение 1С:Документооборот</description>
    </items>
    <items>
      <name>ОператорЭДО1СТакском</name>
      <description>Через оператора ЭДО 1С-Такском</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/ВходящееСообщениеСВД/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПросмотретьСообщение(Команда)
	
	ДанныеФайла = ПолучитьДанныеФайлаДляОткрытия(Объект.Ссылка);
	Если ДанныеФайла <> Неопределено Тогда
		КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаДляОткрытия(СообщениеСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(СообщениеСсылка);
	Если МассивФайлов.Количество() = 1 Тогда
		ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляОткрытия(МассивФайлов[0]);
		Возврат ДанныеФайла;	
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервоеСообщениеВСессии = РаботаССВД.НайтиСообщениеСВДПоИдентификатору(Объект.ИдентификаторСессии);
	
	Если Объект.ФорматСообщения = Справочники.ФорматыСообщенийСВД.СообщениеПоГОСТ53898ВложенныеФайлы
		Или Объект.ФорматСообщения = Справочники.ФорматыСообщенийСВД.Сообщение1СДокументооборот Тогда
	
		МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка);
		Если МассивФайлов.Количество() <> 1 Тогда
			Возврат;
		КонецЕсли;
		
		ФайлСсылка = МассивФайлов[0];
		
		ТекущаяВерсия = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ФайлСсылка, "ТекущаяВерсия");
		ТипХраненияФайла = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущаяВерсия, "ТипХраненияФайла");
		
		ИмяФайлаСПутем = РаботаСФайламиВызовСервера.ПолучитьИмяФайлаСПутемКДвоичнымДанным(ТекущаяВерсия);
		
		ПространствоИмен = РаботаССВД.ПолучитьПространствоИмен(Объект.ФорматСообщения);
		
		//МиСофт+
		ОбъектXDTO = РаботаССВД.ПолучитьXDTO_РБ(ИмяФайлаСПутем, ПространствоИмен);
		//МиСофт-

		Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
			УдалитьФайлы(ИмяФайлаСПутем);
		КонецЕсли;
		
		// Отображаем ОбъектXDTO в HTML
		РаботаССВД.ЗаполнитьHTMLПоXDTO(ТекстHTML, ОбъектXDTO);

	Иначе
		
		РаботаССВДПереопределяемый.ОтобразитьСообщениеСВДВHTML(ТекстHTML, Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
